Корни отделены графическим методом. Т.е. я оценил сверху отрезок, в котором находятся корни. Например, [+-0.7; +-0.7]. 
Можно и [+-1; +-1], разница только в количестве итераций метода.

На вход поступает тип array, который подхватывается lambda и подставляется в символьные уравнения, составляющие Якобиан J и F

(** F - есть x**2+y**2=1 и y=tanx, только в нормализованном виде)

Наша цель: Взять модуль от разницы корня на n итерации и на предыдущей (n-1). Как только модуль становится меньше наперед указанной точности -> print корни
